<br><br>
<b><font size=100>SQL</font></b>
<br>
<br>
By अंkur गोswami
____

In [1]:
import sqlite3 as sql
import pandas as pd

In [2]:
class Query:
    def __init__(self, path):
        self.path=path
    def run(self, query):
        conn=sql.connect(self.path)
        cur=conn.execute(query)
        result=cur.fetchall()
        conn.close()
        return pd.DataFrame(result,columns=[i[0] for i in cur.description])

In [3]:
query=Query('./data/sql/DEPT_EMP.db')

## SELECT Clause
The SELECT statement is used to select data FROM a database. The data returned is stored in a result table, called the result-set.

___SELECT * FROM EMP;___

In [4]:
query.run('SELECT * FROM EMP;')

    EMPNO   ENAME        JOB     MGR  HIREDATE   SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0   93/6/13   800     0.0      20
1    7499   ALLEN   SALESMAN  7698.0   98/8/15  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0   96/3/26  1250   500.0      30
3    7566   JONES    MANAGER  7839.0  95/10/31  2975     NaN      20
4    7698   BLAKE    MANAGER  7839.0   92/6/11  2850     NaN      30
5    7782   CLARK    MANAGER  7839.0   93/5/14  2450     NaN      10
6    7788   SCOTT    ANALYST  7566.0    96/3/5  3000     NaN      20
7    7839    KING  PRESIDENT     NaN    90/6/9  5000     0.0      10
8    7844  TURNER   SALESMAN  7698.0    95/6/4  1500     0.0      30
9    7876   ADAMS      CLERK  7788.0    99/6/4  1100     NaN      20
10   7900   JAMES      CLERK  7698.0   00/6/23   950     NaN      30
11   7934  MILLER      CLERK  7782.0   00/1/21  1300     NaN      10
12   7902    FORD    ANALYST  7566.0   97/12/5  3000     NaN      20
13   7654  MARTIN   SALESMAN  7698.0   98/12/5  1250  1400.0      30

___SELECT SAL FROM EMP;___

In [5]:
query.run('SELECT SAL FROM EMP;')

     SAL
0    800
1   1600
2   1250
3   2975
4   2850
5   2450
6   3000
7   5000
8   1500
9   1100
10   950
11  1300
12  3000
13  1250

___SELECT ENAME, SAL FROM EMP;___

In [6]:
query.run('SELECT ENAME, SAL FROM EMP;')

     ENAME   SAL
0    SMITH   800
1    ALLEN  1600
2     WARD  1250
3    JONES  2975
4    BLAKE  2850
5    CLARK  2450
6    SCOTT  3000
7     KING  5000
8   TURNER  1500
9    ADAMS  1100
10   JAMES   950
11  MILLER  1300
12    FORD  3000
13  MARTIN  1250

## WHERE Clause
The WHERE clause is used to filter records. The WHERE clause is used to extract only those records that fulfill a specified condition.

### Comparison Operators:
Equal to: `=`<br>
Not equal to: `!=` and `<>`<br>
Greater than: `>`<br>
Less than: `<`<br>
Greater than or equal to: `>=`<br>
Less than or equal to: `<=`<br>

___SELECT * FROM EMP <br>
WHERE JOB = 'MANAGER';___<br>

In [7]:
query.run('''SELECT * FROM EMP
            WHERE JOB='MANAGER';''')

   EMPNO  ENAME      JOB   MGR  HIREDATE   SAL  COMM  DEPTNO
0   7566  JONES  MANAGER  7839  95/10/31  2975  None      20
1   7698  BLAKE  MANAGER  7839   92/6/11  2850  None      30
2   7782  CLARK  MANAGER  7839   93/5/14  2450  None      10

## AND operator
The AND operator displays a record if all the conditions separated by AND are TRUE.

___SELECT * FROM EMP<br>
WHERE JOB='SALESMAN'<br>
AND SAL>=1300;<br>___

In [8]:
query.run('''SELECT * FROM EMP
            WHERE JOB='SALESMAN'
            AND SAL>=1300;
            ''')

   EMPNO   ENAME       JOB   MGR HIREDATE   SAL  COMM  DEPTNO
0   7499   ALLEN  SALESMAN  7698  98/8/15  1600   300      30
1   7844  TURNER  SALESMAN  7698   95/6/4  1500     0      30

## OR operator
The OR operator displays a record if any of the conditions separated by OR is TRUE.

___SELECT * FROM EMP<br>
WHERE JOB='SALESMAN'<br>
OR SAL>=1300;<br>___

In [9]:
query.run('''SELECT * FROM EMP
            WHERE JOB='SALESMAN'
            OR SAL>=1300;
            ''')

    EMPNO   ENAME        JOB     MGR  HIREDATE   SAL    COMM  DEPTNO
0    7499   ALLEN   SALESMAN  7698.0   98/8/15  1600   300.0      30
1    7521    WARD   SALESMAN  7698.0   96/3/26  1250   500.0      30
2    7566   JONES    MANAGER  7839.0  95/10/31  2975     NaN      20
3    7698   BLAKE    MANAGER  7839.0   92/6/11  2850     NaN      30
4    7782   CLARK    MANAGER  7839.0   93/5/14  2450     NaN      10
5    7788   SCOTT    ANALYST  7566.0    96/3/5  3000     NaN      20
6    7839    KING  PRESIDENT     NaN    90/6/9  5000     0.0      10
7    7844  TURNER   SALESMAN  7698.0    95/6/4  1500     0.0      30
8    7934  MILLER      CLERK  7782.0   00/1/21  1300     NaN      10
9    7902    FORD    ANALYST  7566.0   97/12/5  3000     NaN      20
10   7654  MARTIN   SALESMAN  7698.0   98/12/5  1250  1400.0      30

___SELECT ENAME FROM EMP<br>
WHERE (JOB <> MANAGER AND JOB != SALESMAN)<br>
AND SAL >= 2000;___<br>

In [10]:
query.run('''SELECT ENAME FROM EMP
            WHERE (JOB <> 'MANAGER' AND JOB != 'SALESMAN')
            AND SAL >= 2000;
        ''')

   ENAME
0  SCOTT
1   KING
2   FORD

## IN operator
The IN operator allows you to specify multiple values in a WHERE clause. The IN operator is a shorthand for multiple OR conditions.

___SELECT * FROM EMP<br>
WHERE JOB IN ('ANALYST','CLERK');___<br>

In [11]:
query.run('''SELECT * FROM EMP
            WHERE JOB IN ('ANALYST','CLERK');
            ''')

   EMPNO   ENAME      JOB   MGR HIREDATE   SAL  COMM  DEPTNO
0   7369   SMITH    CLERK  7902  93/6/13   800   0.0      20
1   7788   SCOTT  ANALYST  7566   96/3/5  3000   NaN      20
2   7876   ADAMS    CLERK  7788   99/6/4  1100   NaN      20
3   7900   JAMES    CLERK  7698  00/6/23   950   NaN      30
4   7934  MILLER    CLERK  7782  00/1/21  1300   NaN      10
5   7902    FORD  ANALYST  7566  97/12/5  3000   NaN      20

## BETWEEN operator
The BETWEEN operator selects values within a given range. The values can be numbers, text, or dates. The BETWEEN operator is inclusive: begin and end values are included.

___SELECT * FROM EMP<br>
WHERE HIREDATE BETWEEN '93/5/14' AND '99/6/4';___<br>

In [12]:
query.run('''SELECT * FROM EMP
            WHERE HIREDATE BETWEEN '93/5/14' AND '99/6/4';
            ''')

   EMPNO   ENAME       JOB   MGR  HIREDATE   SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902   93/6/13   800     0.0      20
1   7499   ALLEN  SALESMAN  7698   98/8/15  1600   300.0      30
2   7521    WARD  SALESMAN  7698   96/3/26  1250   500.0      30
3   7566   JONES   MANAGER  7839  95/10/31  2975     NaN      20
4   7782   CLARK   MANAGER  7839   93/5/14  2450     NaN      10
5   7788   SCOTT   ANALYST  7566    96/3/5  3000     NaN      20
6   7844  TURNER  SALESMAN  7698    95/6/4  1500     0.0      30
7   7876   ADAMS     CLERK  7788    99/6/4  1100     NaN      20
8   7902    FORD   ANALYST  7566   97/12/5  3000     NaN      20
9   7654  MARTIN  SALESMAN  7698   98/12/5  1250  1400.0      30

## NOT operator
The NOT operator displays a record if the condition(s) is NOT TRUE.

___SELECT * FROM EMP<br>
WHERE JOB NOT IN ('ANALYST','CLERK');___<br>

In [13]:
query.run('''SELECT * FROM EMP
            WHERE JOB NOT IN ('ANALYST','CLERK');
            ''')

   EMPNO   ENAME        JOB     MGR  HIREDATE   SAL    COMM  DEPTNO
0   7499   ALLEN   SALESMAN  7698.0   98/8/15  1600   300.0      30
1   7521    WARD   SALESMAN  7698.0   96/3/26  1250   500.0      30
2   7566   JONES    MANAGER  7839.0  95/10/31  2975     NaN      20
3   7698   BLAKE    MANAGER  7839.0   92/6/11  2850     NaN      30
4   7782   CLARK    MANAGER  7839.0   93/5/14  2450     NaN      10
5   7839    KING  PRESIDENT     NaN    90/6/9  5000     0.0      10
6   7844  TURNER   SALESMAN  7698.0    95/6/4  1500     0.0      30
7   7654  MARTIN   SALESMAN  7698.0   98/12/5  1250  1400.0      30

___SELECT * FROM EMP<br>
WHERE HIREDATE NOT BETWEEN '93/5/14' AND '99/6/4';___<br>

In [14]:
query.run('''SELECT * FROM EMP
            WHERE HIREDATE NOT BETWEEN '93/5/14' AND '99/6/4';
            ''')

   EMPNO   ENAME        JOB     MGR HIREDATE   SAL  COMM  DEPTNO
0   7698   BLAKE    MANAGER  7839.0  92/6/11  2850   NaN      30
1   7839    KING  PRESIDENT     NaN   90/6/9  5000   0.0      10
2   7900   JAMES      CLERK  7698.0  00/6/23   950   NaN      30
3   7934  MILLER      CLERK  7782.0  00/1/21  1300   NaN      10

## IS operator
Equivalent to `=` operator.

___SELECT * FROM EMP <br>
WHERE JOB IS 'MANAGER';___<br>

In [15]:
query.run('''SELECT * FROM EMP
            WHERE JOB='MANAGER';''')

   EMPNO  ENAME      JOB   MGR  HIREDATE   SAL  COMM  DEPTNO
0   7566  JONES  MANAGER  7839  95/10/31  2975  None      20
1   7698  BLAKE  MANAGER  7839   92/6/11  2850  None      30
2   7782  CLARK  MANAGER  7839   93/5/14  2450  None      10

## NULL values

___SELECT * FROM EMP <br>
WHERE COMM IS NULL;___<br>

In [16]:
query.run('''SELECT * FROM EMP
            WHERE COMM IS NULL;''')

   EMPNO   ENAME      JOB   MGR  HIREDATE   SAL  COMM  DEPTNO
0   7566   JONES  MANAGER  7839  95/10/31  2975  None      20
1   7698   BLAKE  MANAGER  7839   92/6/11  2850  None      30
2   7782   CLARK  MANAGER  7839   93/5/14  2450  None      10
3   7788   SCOTT  ANALYST  7566    96/3/5  3000  None      20
4   7876   ADAMS    CLERK  7788    99/6/4  1100  None      20
5   7900   JAMES    CLERK  7698   00/6/23   950  None      30
6   7934  MILLER    CLERK  7782   00/1/21  1300  None      10
7   7902    FORD  ANALYST  7566   97/12/5  3000  None      20

___SELECT * FROM EMP <br>
WHERE COMM = NULL;___<br>

In [17]:
query.run('''SELECT * FROM EMP
            WHERE COMM=NULL;''')

Empty DataFrame
Columns: [EMPNO, ENAME, JOB, MGR, HIREDATE, SAL, COMM, DEPTNO]
Index: []

__Note:__ `IS` & `=` are not equivalent in case of a null value.

## LIKE Clause
The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.

### Wildcards

### %
Represents zero or more characters.

___SELECT * FROM EMP<br>
WHERE JOB LIKE '%MAN';___<br>

In [18]:
query.run('''SELECT * FROM EMP
            WHERE JOB LIKE '%MAN';
            ''')

   EMPNO   ENAME       JOB   MGR HIREDATE   SAL  COMM  DEPTNO
0   7499   ALLEN  SALESMAN  7698  98/8/15  1600   300      30
1   7521    WARD  SALESMAN  7698  96/3/26  1250   500      30
2   7844  TURNER  SALESMAN  7698   95/6/4  1500     0      30
3   7654  MARTIN  SALESMAN  7698  98/12/5  1250  1400      30

___SELECT * FROM EMP<br>
WHERE JOB LIKE 'MAN%';___<br>

In [19]:
query.run('''SELECT * FROM EMP
            WHERE JOB LIKE 'MAN%';
            ''')

   EMPNO  ENAME      JOB   MGR  HIREDATE   SAL  COMM  DEPTNO
0   7566  JONES  MANAGER  7839  95/10/31  2975  None      20
1   7698  BLAKE  MANAGER  7839   92/6/11  2850  None      30
2   7782  CLARK  MANAGER  7839   93/5/14  2450  None      10

___SELECT * FROM EMP<br>
WHERE JOB LIKE '%MAN%';___<br>

In [20]:
query.run('''SELECT * FROM EMP
            WHERE JOB LIKE '%MAN%';
            ''')

   EMPNO   ENAME       JOB   MGR  HIREDATE   SAL    COMM  DEPTNO
0   7499   ALLEN  SALESMAN  7698   98/8/15  1600   300.0      30
1   7521    WARD  SALESMAN  7698   96/3/26  1250   500.0      30
2   7566   JONES   MANAGER  7839  95/10/31  2975     NaN      20
3   7698   BLAKE   MANAGER  7839   92/6/11  2850     NaN      30
4   7782   CLARK   MANAGER  7839   93/5/14  2450     NaN      10
5   7844  TURNER  SALESMAN  7698    95/6/4  1500     0.0      30
6   7654  MARTIN  SALESMAN  7698   98/12/5  1250  1400.0      30

### _
Represents a single character

___SELECT * FROM EMP<br>
WHERE ENAME LIKE '\_\_\_\_S';___<br>

In [21]:
query.run('''SELECT * FROM EMP
            WHERE ENAME LIKE '____S';
            ''')

   EMPNO  ENAME      JOB   MGR  HIREDATE   SAL  COMM  DEPTNO
0   7566  JONES  MANAGER  7839  95/10/31  2975  None      20
1   7876  ADAMS    CLERK  7788    99/6/4  1100  None      20
2   7900  JAMES    CLERK  7698   00/6/23   950  None      30

## ALIAS

___SELECT ENAME AS Employee, SAL AS Salary, COMM AS Commision <br>
FROM EMP;___<br>

In [22]:
query.run('''SELECT ENAME AS Employee, SAL AS Salary, COMM AS Commision
            FROM EMP;
            ''')

   Employee  Salary  Commision
0     SMITH     800        0.0
1     ALLEN    1600      300.0
2      WARD    1250      500.0
3     JONES    2975        NaN
4     BLAKE    2850        NaN
5     CLARK    2450        NaN
6     SCOTT    3000        NaN
7      KING    5000        0.0
8    TURNER    1500        0.0
9     ADAMS    1100        NaN
10    JAMES     950        NaN
11   MILLER    1300        NaN
12     FORD    3000        NaN
13   MARTIN    1250     1400.0

__Note:__ Cannot use whitespaces while aliasing columns. Instead use underscore in place of whitespace or put column alias names in double quotes.

__Note:__ Not writing `AS` will still work. But it's a convention to do aliasing using `AS`, as it is more-readable & works with most databases.

___SELECT ENAME "Employee name", SAL Salary, COMM Commision <br>
FROM EMP;___<br>

In [23]:
query.run('''SELECT ENAME "Employee name", SAL Salary, COMM Commision 
            FROM EMP;
            ''')

   Employee name  Salary  Commision
0          SMITH     800        0.0
1          ALLEN    1600      300.0
2           WARD    1250      500.0
3          JONES    2975        NaN
4          BLAKE    2850        NaN
5          CLARK    2450        NaN
6          SCOTT    3000        NaN
7           KING    5000        0.0
8         TURNER    1500        0.0
9          ADAMS    1100        NaN
10         JAMES     950        NaN
11        MILLER    1300        NaN
12          FORD    3000        NaN
13        MARTIN    1250     1400.0

## CONCATENATION

### Using ||:
`||` is used to concatenate two or more strings.

___SELECT 'My Name is ' || ENAME<br>
FROM EMP;___<br>

In [24]:
query.run('''SELECT 'My Name is ' || ENAME
            FROM EMP;
            ''')

   'My Name is ' || ENAME
0        My Name is SMITH
1        My Name is ALLEN
2         My Name is WARD
3        My Name is JONES
4        My Name is BLAKE
5        My Name is CLARK
6        My Name is SCOTT
7         My Name is KING
8       My Name is TURNER
9        My Name is ADAMS
10       My Name is JAMES
11      My Name is MILLER
12        My Name is FORD
13      My Name is MARTIN

___SELECT ENAME || ' makes $' || SAL || ' per month.' AS "Generated Report"<br>
FROM EMP;___<br>

In [25]:
query.run('''SELECT ENAME || ' is a ' || JOB || ' and makes $' || SAL || ' per month.' AS "Generated Report"
            FROM EMP;
            ''')

                                   Generated Report
0        SMITH is a CLERK and makes $800 per month.
1    ALLEN is a SALESMAN and makes $1600 per month.
2     WARD is a SALESMAN and makes $1250 per month.
3     JONES is a MANAGER and makes $2975 per month.
4     BLAKE is a MANAGER and makes $2850 per month.
5     CLARK is a MANAGER and makes $2450 per month.
6     SCOTT is a ANALYST and makes $3000 per month.
7    KING is a PRESIDENT and makes $5000 per month.
8   TURNER is a SALESMAN and makes $1500 per month.
9       ADAMS is a CLERK and makes $1100 per month.
10       JAMES is a CLERK and makes $950 per month.
11     MILLER is a CLERK and makes $1300 per month.
12     FORD is a ANALYST and makes $3000 per month.
13  MARTIN is a SALESMAN and makes $1250 per month.

### Using CONCAT():
CONCAT() takes 2 values as parameters and returns a concatenated result.

## SORTING

___SELECT ENAME, JOB<br>
FROM EMP<br>
ORDER BY ENAME;___<br>

In [26]:
query.run('''SELECT ENAME, JOB
            FROM EMP
            ORDER BY ENAME;
        ''')

     ENAME        JOB
0    ADAMS      CLERK
1    ALLEN   SALESMAN
2    BLAKE    MANAGER
3    CLARK    MANAGER
4     FORD    ANALYST
5    JAMES      CLERK
6    JONES    MANAGER
7     KING  PRESIDENT
8   MARTIN   SALESMAN
9   MILLER      CLERK
10   SCOTT    ANALYST
11   SMITH      CLERK
12  TURNER   SALESMAN
13    WARD   SALESMAN

__Note:__ Sorting is implicitly Ascending in SQL.

### Explicit Ascending order:

___SELECT ENAME, JOB<br>
FROM EMP<br>
ORDER BY SAL ASC;___<br>

In [27]:
query.run('''SELECT ENAME, SAL
            FROM EMP
            ORDER BY SAL ASC;
        ''')

     ENAME   SAL
0    SMITH   800
1    JAMES   950
2    ADAMS  1100
3     WARD  1250
4   MARTIN  1250
5   MILLER  1300
6   TURNER  1500
7    ALLEN  1600
8    CLARK  2450
9    BLAKE  2850
10   JONES  2975
11   SCOTT  3000
12    FORD  3000
13    KING  5000

### Descending order:

___SELECT ENAME, JOB<br>
FROM EMP<br>
ORDER BY SAL DESC;___<br>

In [28]:
query.run('''SELECT ENAME, SAL
            FROM EMP
            ORDER BY SAL DESC;
        ''')

     ENAME   SAL
0     KING  5000
1    SCOTT  3000
2     FORD  3000
3    JONES  2975
4    BLAKE  2850
5    CLARK  2450
6    ALLEN  1600
7   TURNER  1500
8   MILLER  1300
9     WARD  1250
10  MARTIN  1250
11   ADAMS  1100
12   JAMES   950
13   SMITH   800

### Multilevel Sorting

___SELECT DEPTNO, SAL, ENAME<br>
FROM EMP<br>
ORDER BY DEPTNO, SAL DESC, ENAME;___<br>

In [29]:
query.run('''SELECT DEPTNO, SAL, ENAME
            FROM EMP
            ORDER BY DEPTNO, SAL DESC, ENAME;
        ''')

    DEPTNO   SAL   ENAME
0       10  5000    KING
1       10  2450   CLARK
2       10  1300  MILLER
3       20  3000    FORD
4       20  3000   SCOTT
5       20  2975   JONES
6       20  1100   ADAMS
7       20   800   SMITH
8       30  2850   BLAKE
9       30  1600   ALLEN
10      30  1500  TURNER
11      30  1250  MARTIN
12      30  1250    WARD
13      30   950   JAMES

# SQL Single Row Functions Functions
Can be used with SELECT as well as WHERE clause.

## LOWER()
To convert data into lowercase.

___SELECT LOWER(ENAME) AS Name, HIREDATE<br>
FROM EMP;___<br>

In [30]:
query.run('''SELECT LOWER(ENAME) AS Name, HIREDATE
            FROM EMP;
        ''')

      Name  HIREDATE
0    smith   93/6/13
1    allen   98/8/15
2     ward   96/3/26
3    jones  95/10/31
4    blake   92/6/11
5    clark   93/5/14
6    scott    96/3/5
7     king    90/6/9
8   turner    95/6/4
9    adams    99/6/4
10   james   00/6/23
11  miller   00/1/21
12    ford   97/12/5
13  martin   98/12/5

## UPPER()
To convert data into uppercase.

## INITCAP()
Captilizes first letter of every word in the string passed to it.

## DISTINCT()
Returns unique values in a column.

___SELECT DISTINCT(JOB)<br>
FROM EMP;___<br>

In [31]:
query.run('''SELECT DISTINCT(JOB)
            FROM EMP;
        ''')

         JOB
0      CLERK
1   SALESMAN
2    MANAGER
3    ANALYST
4  PRESIDENT

## LENGTH()
Returns length of a string.

___SELECT ENAME, LENGTH(ENAME)<br>
FROM EMP;___<br>

In [32]:
query.run('''SELECT ENAME, LENGTH(ENAME)
            FROM EMP;
        ''')

     ENAME  LENGTH(ENAME)
0    SMITH              5
1    ALLEN              5
2     WARD              4
3    JONES              5
4    BLAKE              5
5    CLARK              5
6    SCOTT              5
7     KING              4
8   TURNER              6
9    ADAMS              5
10   JAMES              5
11  MILLER              6
12    FORD              4
13  MARTIN              6

## COUNT()
Returns count of values in a column.

___SELECT COUNT(ENAME)<br>
FROM EMP;___<br>

In [33]:
query.run('''SELECT COUNT(ENAME)
            FROM EMP;
        ''')

   COUNT(ENAME)
0            14

## DUAL Table
The DUAL is special one row, one column table present by default in all __Oracle__ databases. The owner of DUAL is SYS (SYS owns the data dictionary, therefore DUAL is part of the data dictionary.) but DUAL can be accessed by every user. It can be modified  to have more than one column but it always contains one row.

## SUBSTR()
Takes in 3 arguments, i.e. the string, the starting index & the number of characters to be extracted (if not provided then goes on till end). It returns the subtring of the string given to it.

___SELECT ENAME, SUBSTR(ENAME, 2, 3) AS SUBSTRING<br>
FROM EMP;___<br>

In [40]:
query.run("""SELECT ENAME, SUBSTR(ENAME, 2, 3) AS SUBSTRING
            FROM EMP;""")

     ENAME SUBSTRING
0    SMITH       MIT
1    ALLEN       LLE
2     WARD       ARD
3    JONES       ONE
4    BLAKE       LAK
5    CLARK       LAR
6    SCOTT       COT
7     KING       ING
8   TURNER       URN
9    ADAMS       DAM
10   JAMES       AME
11  MILLER       ILL
12    FORD       ORD
13  MARTIN       ART

## LPAD()
Takes in 3 arguments, i.e. the string that we want to pad, length of string after padding & the character (whitespace by default) to pad with. It returns the left padded string.

___SELECT ENAME, LPAD(ENAME, 8, '$') AS PADDED<br>
FROM EMP;___<br>

## RPAD()
Takes in 3 arguments, i.e. the string that we want to pad, length of string after padding & the character (whitespace by default) to pad with. It returns the right padded string.

## ROUND()
Takes in 2 arguments, i.e. the value to round off & the number (1 by default) of decimal places. It returns the rounded off number.

___SELECT ENAME, ROUND(100.2253,2)<br>
FROM EMP;___<br>

In [49]:
query.run("""SELECT ENAME, ROUND(100.2253,2)
            FROM EMP;""")

     ENAME  ROUND(100.2253,2)
0    SMITH             100.23
1    ALLEN             100.23
2     WARD             100.23
3    JONES             100.23
4    BLAKE             100.23
5    CLARK             100.23
6    SCOTT             100.23
7     KING             100.23
8   TURNER             100.23
9    ADAMS             100.23
10   JAMES             100.23
11  MILLER             100.23
12    FORD             100.23
13  MARTIN             100.23

# Insertion

In [4]:
cur=conn.execute("insert into Employee values(1,'Ankur Goswami',19,200000);")

In [5]:
cur=conn.execute("insert into Employee values(2,'Murtaza Nazir',21,10000)")
cur=conn.execute("insert into Employee(empid,empname,age) values(3,'RJ Rahul',21)")

In [6]:
cur=conn.execute("insert into Employee values(4,'Naveed Unjum',21,0)")

# Displaying

In [7]:
cur=conn.execute('select * from Employee')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000),
 (2, 'Murtaza Nazir', 21, 10000),
 (3, 'RJ Rahul', 21, 10000),
 (4, 'Naveed Unjum', 21, 0)]

# Deletion

In [8]:
cur=conn.execute("delete from Employee where empid=4")

In [9]:
cur=conn.execute('select * from Employee')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000),
 (2, 'Murtaza Nazir', 21, 10000),
 (3, 'RJ Rahul', 21, 10000)]

In [10]:
cur=conn.execute("insert into Employee values(4,'Naveed Unjum',21,0)")

# Update

In [11]:
cur=conn.execute("update Employee set empname='Naveed Unjum(Unemployed)' where salary=0")

In [12]:
cur=conn.execute('select * from Employee')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000),
 (2, 'Murtaza Nazir', 21, 10000),
 (3, 'RJ Rahul', 21, 10000),
 (4, 'Naveed Unjum(Unemployed)', 21, 0)]

# Adding Columns

In [13]:
cur=conn.execute("alter table Employee add column dept varchar(3)")

In [14]:
cur=conn.execute('select * from Employee')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000, None),
 (2, 'Murtaza Nazir', 21, 10000, None),
 (3, 'RJ Rahul', 21, 10000, None),
 (4, 'Naveed Unjum(Unemployed)', 21, 0, None)]

In [15]:
cur=conn.execute("alter table Employee drop dept")

OperationalError: near "drop": syntax error

In [16]:
cur=conn.execute('select * from Employee')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000, None),
 (2, 'Murtaza Nazir', 21, 10000, None),
 (3, 'RJ Rahul', 21, 10000, None),
 (4, 'Naveed Unjum(Unemployed)', 21, 0, None)]

# Regex

In [20]:
cur=conn.execute('select * from Employee where empname like "%KUR%"')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000, None), (5, 'aNKUR gOSWAMI', 19, 50000, None)]

In [27]:
cur=conn.execute('select * from Employee where empname like "n%)"')
cur.fetchall()

[(4, 'Naveed Unjum(Unemployed)', 21, 0, None)]

In [28]:
cur=conn.execute('select * from Employee where empname like "%r%"')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000, None),
 (2, 'Murtaza Nazir', 21, 10000, None),
 (3, 'RJ Rahul', 21, 10000, None),
 (5, 'aNKUR gOSWAMI', 19, 50000, None)]

In [30]:
cur=conn.execute('select * from Employee where empname like "%u_"')
cur.fetchall()

[(3, 'RJ Rahul', 21, 10000, None)]

In [46]:
cur=conn.execute('select * from Employee where empname not like "______________%"')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000, None),
 (2, 'Murtaza Nazir', 21, 10000, None),
 (3, 'RJ Rahul', 21, 10000, None),
 (5, 'aNKUR gOSWAMI', 19, 50000, None)]